//*****************************************************************************
//
// タイトルシーン
//
//*****************************************************************************

#include "SceneTitle.h"

using namespace KeyString;
using namespace Common;

//=============================================================================
// コンストラクタ
// 引　数：Engine* エンジンクラスのアドレス
//=============================================================================
SceneTitle::SceneTitle()
	: Scene()
	, m_titleUI(&m_nowSceneData)
{

}

//=============================================================================
// デストラクタ
//=============================================================================
SceneTitle::~SceneTitle()
{
	Exit();
}

//=============================================================================
// シーンの実行時に１度だけ呼び出される開始処理関数
//=============================================================================
void SceneTitle::Start()
{
	g_Engine->GetCamera()->SetFov(80.0f);

	g_Engine->SetWindowMode(WindowMode::WindowMaximum, nullptr);

	DWORD startTime = timeGetTime();

	m_titleUI.Initilaize();
	m_titleBack.Initialize();

	DWORD endTime= timeGetTime();
	printf("シーンの初期化が完了しました - %dms\n", endTime - startTime);
}

//=============================================================================
// シーンの実行時に繰り返し呼び出される更新処理関数
//=============================================================================
void SceneTitle::Update()
{
	m_titleUI.Update();

	if (m_titleUI.GetIsStarting()) {
		m_titleBack.SetMoveCamera(false);
	}

	m_titleBack.Update();

	g_Engine->GetWwiseSoundSystem()->Update();
}

//=============================================================================
// シーンの実行時に繰り返し呼び出される描画処理関数
//=============================================================================
void SceneTitle::Draw()
{
	//2D描画のみ行う
	m_titleUI.Draw();
}

//=============================================================================
// シーンの終了時に呼び出される終了処理関数
//=============================================================================
void SceneTitle::Exit()
{
}

#ifdef USE_IMGUI
//=============================================================================
// 日本語入力用
//=============================================================================
void SceneTitle::ImGuiFrameProcess()
{

}
#endif
