#pragma once

#include "GameBase.h"

//-----------------------------------------------------------------------------
//シーンクラスのヘッダファイルをインクルードします。
//-----------------------------------------------------------------------------

#include "Scene\\Scene\Scene.h"
#include "Scene\\SceneInit\\SceneInit.h"
#include "Scene\\SceneTitle\\SceneTitle.h"
#include "Scene\\SceneGame\\SceneGame.h"
#include "Scene\\SceneClear\\SceneClear.h"
#include "Scene\\SceneGameover\\SceneGameover.h"

class Engine;

class Game
{
public:

	//=============================================================================
	// コンストラクタ
	//=============================================================================
	Game();

	//=============================================================================
	// デストラクタ
	//=============================================================================
	~Game();

	//=============================================================================
	// ゲームの初期化
	// 引　数：const HWND & ウィンドウハンドル
	// 　　　　const HINSTANCE & インスタンスハンドル
	//=============================================================================
	void Initialize(const HWND& hAppWnd);

	//=============================================================================
	// 実行
	//=============================================================================
	bool Run();

	void Release();

private:

	//現在のシーンクラスへのポインタ
	Scene* m_pNowScene;

	//-----------------------------------------------------------------------------
	// シーン切り替え
	//-----------------------------------------------------------------------------
	bool ChangeScene();

	//コピー防止
	Game(const Game&);
	Game& operator=(const Game&) = delete;
};























